Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/cfg.h
#define CFG_CFGPCLKGEN1_TCC12CSEL(value)      (CFG_CFGPCLKGEN1_TCC12CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_TCC12CSEL_Pos)) /* Assignment of value for TCC12CSEL in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_TCC12CSEL_NO_CLK      (CFG_CFGPCLKGEN1_TCC12CSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /* (CFG_CFGPCLKGEN1) No Clock Position */
#define CFG_CFGPCLKGEN1_TCC12CSEL_REFO1       (CFG_CFGPCLKGEN1_TCC12CSEL_REFO1_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN1_TCC12CSEL_REFO2       (CFG_CFGPCLKGEN1_TCC12CSEL_REFO2_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN1_TCC12CSEL_REFO3       (CFG_CFGPCLKGEN1_TCC12CSEL_REFO3_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN1_TCC12CSEL_REFO4       (CFG_CFGPCLKGEN1_TCC12CSEL_REFO4_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN1_TCC12CSEL_REFO5       (CFG_CFGPCLKGEN1_TCC12CSEL_REFO5_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN1_TCC12CSEL_REFO6       (CFG_CFGPCLKGEN1_TCC12CSEL_REFO6_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN1_TCC12CSEL_LPCLK       (CFG_CFGPCLKGEN1_TCC12CSEL_LPCLK_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN1_TCC12CD_Pos           _UINT32_(23)                                         /* (CFG_CFGPCLKGEN1) TCC1/2 Clock Disable Position */
#define CFG_CFGPCLKGEN1_TCC12CD_Msk           (_UINT32_(0x1) << CFG_CFGPCLKGEN1_TCC12CD_Pos)       /* (CFG_CFGPCLKGEN1) TCC1/2 Clock Disable Mask */
#define CFG_CFGPCLKGEN1_TCC12CD(value)        (CFG_CFGPCLKGEN1_TCC12CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_TCC12CD_Pos)) /* Assignment of value for TCC12CD in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_TCC12CD_ON_Val      _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_TCC12CD_OFF_Val     _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_TCC12CD_ON            (CFG_CFGPCLKGEN1_TCC12CD_ON_Val << CFG_CFGPCLKGEN1_TCC12CD_Pos) /* (CFG_CFGPCLKGEN1) Enable PGCLK Position */
#define CFG_CFGPCLKGEN1_TCC12CD_OFF           (CFG_CFGPCLKGEN1_TCC12CD_OFF_Val << CFG_CFGPCLKGEN1_TCC12CD_Pos) /* (CFG_CFGPCLKGEN1) Disable PGCLK Position */
#define CFG_CFGPCLKGEN1_SERCOM345CSEL_Pos     _UINT32_(24)                                         /* (CFG_CFGPCLKGEN1) SERCOM3/4/5 Clock Selection Position */
#define CFG_CFGPCLKGEN1_SERCOM345CSEL_Msk     (_UINT32_(0x7) << CFG_CFGPCLKGEN1_SERCOM345CSEL_Pos) /* (CFG_CFGPCLKGEN1) SERCOM3/4/5 Clock Selection Mask */
#define CFG_CFGPCLKGEN1_SERCOM345CSEL(value)  (CFG_CFGPCLKGEN1_SERCOM345CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_SERCOM345CSEL_Pos)) /* Assignment of value for SERCOM345CSEL in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_SERCOM345CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_SERCOM345CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_SERCOM345CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_SERCOM345CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_SERCOM345CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_SERCOM345CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_SERCOM345CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_SERCOM345CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_SERCOM345CSEL_NO_CLK  (CFG_CFGPCLKGEN1_SERCOM345CSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_SERCOM345CSEL_Pos) /* (CFG_CFGPCLKGEN1) No Clock Position */
#define CFG_CFGPCLKGEN1_SERCOM345CSEL_REFO1   (CFG_CFGPCLKGEN1_SERCOM345CSEL_REFO1_Val << CFG_CFGPCLKGEN1_SERCOM345CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN1_SERCOM345CSEL_REFO2   (CFG_CFGPCLKGEN1_SERCOM345CSEL_REFO2_Val << CFG_CFGPCLKGEN1_SERCOM345CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN1_SERCOM345CSEL_REFO3   (CFG_CFGPCLKGEN1_SERCOM345CSEL_REFO3_Val << CFG_CFGPCLKGEN1_SERCOM345CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN1_SERCOM345CSEL_REFO4   (CFG_CFGPCLKGEN1_SERCOM345CSEL_REFO4_Val << CFG_CFGPCLKGEN1_SERCOM345CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN1_SERCOM345CSEL_REFO5   (CFG_CFGPCLKGEN1_SERCOM345CSEL_REFO5_Val << CFG_CFGPCLKGEN1_SERCOM345CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN1_SERCOM345CSEL_REFO6   (CFG_CFGPCLKGEN1_SERCOM345CSEL_REFO6_Val << CFG_CFGPCLKGEN1_SERCOM345CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN1_SERCOM345CSEL_LPCLK   (CFG_CFGPCLKGEN1_SERCOM345CSEL_LPCLK_Val << CFG_CFGPCLKGEN1_SERCOM345CSEL_Pos) /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN1_SERCOM345CD_Pos       _UINT32_(27)                                         /* (CFG_CFGPCLKGEN1) SERCOM3/4/5 Clock Disable Position */
#define CFG_CFGPCLKGEN1_SERCOM345CD_Msk       (_UINT32_(0x1) << CFG_CFGPCLKGEN1_SERCOM345CD_Pos)   /* (CFG_CFGPCLKGEN1) SERCOM3/4/5 Clock Disable Mask */
#define CFG_CFGPCLKGEN1_SERCOM345CD(value)    (CFG_CFGPCLKGEN1_SERCOM345CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_SERCOM345CD_Pos)) /* Assignment of value for SERCOM345CD in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_SERCOM345CD_ON_Val  _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_SERCOM345CD_OFF_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_SERCOM345CD_ON        (CFG_CFGPCLKGEN1_SERCOM345CD_ON_Val << CFG_CFGPCLKGEN1_SERCOM345CD_Pos) /* (CFG_CFGPCLKGEN1) Enable PGCLK Position */
#define CFG_CFGPCLKGEN1_SERCOM345CD_OFF       (CFG_CFGPCLKGEN1_SERCOM345CD_OFF_Val << CFG_CFGPCLKGEN1_SERCOM345CD_Pos) /* (CFG_CFGPCLKGEN1) Disable PGCLK Position */
#define CFG_CFGPCLKGEN1_CM4TCSEL_Pos          _UINT32_(28)                                         /* (CFG_CFGPCLKGEN1) CM4T Clock Selection Position */
#define CFG_CFGPCLKGEN1_CM4TCSEL_Msk          (_UINT32_(0x7) << CFG_CFGPCLKGEN1_CM4TCSEL_Pos)      /* (CFG_CFGPCLKGEN1) CM4T Clock Selection Mask */
#define CFG_CFGPCLKGEN1_CM4TCSEL(value)       (CFG_CFGPCLKGEN1_CM4TCSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_CM4TCSEL_Pos)) /* Assignment of value for CM4TCSEL in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_CM4TCSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_CM4TCSEL_REFO1_Val  _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_CM4TCSEL_REFO2_Val  _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_CM4TCSEL_REFO3_Val  _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_CM4TCSEL_REFO4_Val  _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_CM4TCSEL_REFO5_Val  _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_CM4TCSEL_REFO6_Val  _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_CM4TCSEL_LPCLK_Val  _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_CM4TCSEL_NO_CLK       (CFG_CFGPCLKGEN1_CM4TCSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_CM4TCSEL_Pos) /* (CFG_CFGPCLKGEN1) No Clock Position */
#define CFG_CFGPCLKGEN1_CM4TCSEL_REFO1        (CFG_CFGPCLKGEN1_CM4TCSEL_REFO1_Val << CFG_CFGPCLKGEN1_CM4TCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN1_CM4TCSEL_REFO2        (CFG_CFGPCLKGEN1_CM4TCSEL_REFO2_Val << CFG_CFGPCLKGEN1_CM4TCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN1_CM4TCSEL_REFO3        (CFG_CFGPCLKGEN1_CM4TCSEL_REFO3_Val << CFG_CFGPCLKGEN1_CM4TCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN1_CM4TCSEL_REFO4        (CFG_CFGPCLKGEN1_CM4TCSEL_REFO4_Val << CFG_CFGPCLKGEN1_CM4TCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN1_CM4TCSEL_REFO5        (CFG_CFGPCLKGEN1_CM4TCSEL_REFO5_Val << CFG_CFGPCLKGEN1_CM4TCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN1_CM4TCSEL_REFO6        (CFG_CFGPCLKGEN1_CM4TCSEL_REFO6_Val << CFG_CFGPCLKGEN1_CM4TCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN1_CM4TCSEL_LPCLK        (CFG_CFGPCLKGEN1_CM4TCSEL_LPCLK_Val << CFG_CFGPCLKGEN1_CM4TCSEL_Pos) /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN1_CM4TCD_Pos            _UINT32_(31)                                         /* (CFG_CFGPCLKGEN1) CM4T Clock Disable Position */
#define CFG_CFGPCLKGEN1_CM4TCD_Msk            (_UINT32_(0x1) << CFG_CFGPCLKGEN1_CM4TCD_Pos)        /* (CFG_CFGPCLKGEN1) CM4T Clock Disable Mask */
#define CFG_CFGPCLKGEN1_CM4TCD(value)         (CFG_CFGPCLKGEN1_CM4TCD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_CM4TCD_Pos)) /* Assignment of value for CM4TCD in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_CM4TCD_ON_Val       _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_CM4TCD_OFF_Val      _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_CM4TCD_ON             (CFG_CFGPCLKGEN1_CM4TCD_ON_Val << CFG_CFGPCLKGEN1_CM4TCD_Pos) /* (CFG_CFGPCLKGEN1) Enable PGCLK Position */
#define CFG_CFGPCLKGEN1_CM4TCD_OFF            (CFG_CFGPCLKGEN1_CM4TCD_OFF_Val << CFG_CFGPCLKGEN1_CM4TCD_Pos) /* (CFG_CFGPCLKGEN1) Disable PGCLK Position */
#define CFG_CFGPCLKGEN1_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (CFG_CFGPCLKGEN1) Register Mask  */


