Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/cfg.h
#define CFG_CFGPCLKGEN3_TCC0CSEL_REFO1        (CFG_CFGPCLKGEN3_TCC0CSEL_REFO1_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN3_TCC0CSEL_REFO2        (CFG_CFGPCLKGEN3_TCC0CSEL_REFO2_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN3_TCC0CSEL_REFO3        (CFG_CFGPCLKGEN3_TCC0CSEL_REFO3_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN3_TCC0CSEL_REFO4        (CFG_CFGPCLKGEN3_TCC0CSEL_REFO4_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN3_TCC0CSEL_REFO5        (CFG_CFGPCLKGEN3_TCC0CSEL_REFO5_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN3_TCC0CSEL_REFO6        (CFG_CFGPCLKGEN3_TCC0CSEL_REFO6_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN3_TCC0CSEL_LPCLK        (CFG_CFGPCLKGEN3_TCC0CSEL_LPCLK_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN3_TCC0CD_Pos            _UINT32_(23)                                         /* (CFG_CFGPCLKGEN3) TCC0 Clock Disable Position */
#define CFG_CFGPCLKGEN3_TCC0CD_Msk            (_UINT32_(0x1) << CFG_CFGPCLKGEN3_TCC0CD_Pos)        /* (CFG_CFGPCLKGEN3) TCC0 Clock Disable Mask */
#define CFG_CFGPCLKGEN3_TCC0CD(value)         (CFG_CFGPCLKGEN3_TCC0CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_TCC0CD_Pos)) /* Assignment of value for TCC0CD in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_TCC0CD_ON_Val       _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_TCC0CD_OFF_Val      _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_TCC0CD_ON             (CFG_CFGPCLKGEN3_TCC0CD_ON_Val << CFG_CFGPCLKGEN3_TCC0CD_Pos) /* (CFG_CFGPCLKGEN3) Enable PGCLK Position */
#define CFG_CFGPCLKGEN3_TCC0CD_OFF            (CFG_CFGPCLKGEN3_TCC0CD_OFF_Val << CFG_CFGPCLKGEN3_TCC0CD_Pos) /* (CFG_CFGPCLKGEN3) Disable PGCLK Position */
#define CFG_CFGPCLKGEN3_ETHCLKSEL_Pos         _UINT32_(24)                                         /* (CFG_CFGPCLKGEN3) Ethernet Clock Selection Position */
#define CFG_CFGPCLKGEN3_ETHCLKSEL_Msk         (_UINT32_(0x7) << CFG_CFGPCLKGEN3_ETHCLKSEL_Pos)     /* (CFG_CFGPCLKGEN3) Ethernet Clock Selection Mask */
#define CFG_CFGPCLKGEN3_ETHCLKSEL(value)      (CFG_CFGPCLKGEN3_ETHCLKSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_ETHCLKSEL_Pos)) /* Assignment of value for ETHCLKSEL in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_ETHCLKSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_ETHCLKSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_ETHCLKSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_ETHCLKSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_ETHCLKSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_ETHCLKSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_ETHCLKSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_ETHCLKSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN3_ETHCLKSEL_NO_CLK      (CFG_CFGPCLKGEN3_ETHCLKSEL_NO_CLK_Val << CFG_CFGPCLKGEN3_ETHCLKSEL_Pos) /* (CFG_CFGPCLKGEN3) No Clock Position */
#define CFG_CFGPCLKGEN3_ETHCLKSEL_REFO1       (CFG_CFGPCLKGEN3_ETHCLKSEL_REFO1_Val << CFG_CFGPCLKGEN3_ETHCLKSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN3_ETHCLKSEL_REFO2       (CFG_CFGPCLKGEN3_ETHCLKSEL_REFO2_Val << CFG_CFGPCLKGEN3_ETHCLKSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN3_ETHCLKSEL_REFO3       (CFG_CFGPCLKGEN3_ETHCLKSEL_REFO3_Val << CFG_CFGPCLKGEN3_ETHCLKSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN3_ETHCLKSEL_REFO4       (CFG_CFGPCLKGEN3_ETHCLKSEL_REFO4_Val << CFG_CFGPCLKGEN3_ETHCLKSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN3_ETHCLKSEL_REFO5       (CFG_CFGPCLKGEN3_ETHCLKSEL_REFO5_Val << CFG_CFGPCLKGEN3_ETHCLKSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN3_ETHCLKSEL_REFO6       (CFG_CFGPCLKGEN3_ETHCLKSEL_REFO6_Val << CFG_CFGPCLKGEN3_ETHCLKSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN3_ETHCLKSEL_LPCLK       (CFG_CFGPCLKGEN3_ETHCLKSEL_LPCLK_Val << CFG_CFGPCLKGEN3_ETHCLKSEL_Pos) /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN3_ETHD_Pos              _UINT32_(27)                                         /* (CFG_CFGPCLKGEN3) Ethernet Clock Disable Position */
#define CFG_CFGPCLKGEN3_ETHD_Msk              (_UINT32_(0x1) << CFG_CFGPCLKGEN3_ETHD_Pos)          /* (CFG_CFGPCLKGEN3) Ethernet Clock Disable Mask */
#define CFG_CFGPCLKGEN3_ETHD(value)           (CFG_CFGPCLKGEN3_ETHD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_ETHD_Pos)) /* Assignment of value for ETHD in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_ETHD_ON_Val         _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_ETHD_OFF_Val        _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_ETHD_ON               (CFG_CFGPCLKGEN3_ETHD_ON_Val << CFG_CFGPCLKGEN3_ETHD_Pos) /* (CFG_CFGPCLKGEN3) Enable PGCLK Position */
#define CFG_CFGPCLKGEN3_ETHD_OFF              (CFG_CFGPCLKGEN3_ETHD_OFF_Val << CFG_CFGPCLKGEN3_ETHD_Pos) /* (CFG_CFGPCLKGEN3) Disable PGCLK Position */
#define CFG_CFGPCLKGEN3_CVDCSEL_Pos           _UINT32_(28)                                         /* (CFG_CFGPCLKGEN3) CVD Selection Position */
#define CFG_CFGPCLKGEN3_CVDCSEL_Msk           (_UINT32_(0x7) << CFG_CFGPCLKGEN3_CVDCSEL_Pos)       /* (CFG_CFGPCLKGEN3) CVD Selection Mask */
#define CFG_CFGPCLKGEN3_CVDCSEL(value)        (CFG_CFGPCLKGEN3_CVDCSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_CVDCSEL_Pos)) /* Assignment of value for CVDCSEL in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_CVDCSEL_NO_CLK_Val  _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_CVDCSEL_REFO1_Val   _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_CVDCSEL_REFO2_Val   _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_CVDCSEL_REFO3_Val   _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_CVDCSEL_REFO4_Val   _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_CVDCSEL_REFO5_Val   _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_CVDCSEL_REFO6_Val   _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_CVDCSEL_LPCLK_Val   _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN3_CVDCSEL_NO_CLK        (CFG_CFGPCLKGEN3_CVDCSEL_NO_CLK_Val << CFG_CFGPCLKGEN3_CVDCSEL_Pos) /* (CFG_CFGPCLKGEN3) No Clock Position */
#define CFG_CFGPCLKGEN3_CVDCSEL_REFO1         (CFG_CFGPCLKGEN3_CVDCSEL_REFO1_Val << CFG_CFGPCLKGEN3_CVDCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN3_CVDCSEL_REFO2         (CFG_CFGPCLKGEN3_CVDCSEL_REFO2_Val << CFG_CFGPCLKGEN3_CVDCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN3_CVDCSEL_REFO3         (CFG_CFGPCLKGEN3_CVDCSEL_REFO3_Val << CFG_CFGPCLKGEN3_CVDCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN3_CVDCSEL_REFO4         (CFG_CFGPCLKGEN3_CVDCSEL_REFO4_Val << CFG_CFGPCLKGEN3_CVDCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN3_CVDCSEL_REFO5         (CFG_CFGPCLKGEN3_CVDCSEL_REFO5_Val << CFG_CFGPCLKGEN3_CVDCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN3_CVDCSEL_REFO6         (CFG_CFGPCLKGEN3_CVDCSEL_REFO6_Val << CFG_CFGPCLKGEN3_CVDCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN3_CVDCSEL_LPCLK         (CFG_CFGPCLKGEN3_CVDCSEL_LPCLK_Val << CFG_CFGPCLKGEN3_CVDCSEL_Pos) /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN3_CVDD_Pos              _UINT32_(31)                                         /* (CFG_CFGPCLKGEN3) CVD Clock Disable Position */
#define CFG_CFGPCLKGEN3_CVDD_Msk              (_UINT32_(0x1) << CFG_CFGPCLKGEN3_CVDD_Pos)          /* (CFG_CFGPCLKGEN3) CVD Clock Disable Mask */
#define CFG_CFGPCLKGEN3_CVDD(value)           (CFG_CFGPCLKGEN3_CVDD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_CVDD_Pos)) /* Assignment of value for CVDD in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_CVDD_ON_Val         _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_CVDD_OFF_Val        _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_CVDD_ON               (CFG_CFGPCLKGEN3_CVDD_ON_Val << CFG_CFGPCLKGEN3_CVDD_Pos) /* (CFG_CFGPCLKGEN3) Enable PGCLK Position */
#define CFG_CFGPCLKGEN3_CVDD_OFF              (CFG_CFGPCLKGEN3_CVDD_OFF_Val << CFG_CFGPCLKGEN3_CVDD_Pos) /* (CFG_CFGPCLKGEN3) Disable PGCLK Position */
#define CFG_CFGPCLKGEN3_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (CFG_CFGPCLKGEN3) Register Mask  */


/* -------- CFG_CFGPCLKGEN3CLR : (CFG Offset: 0xA4) (R/W 32) Bit clear register -------- */
#define CFG_CFGPCLKGEN3CLR_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN3CLR) Bit clear register  Reset Value */

#define CFG_CFGPCLKGEN3CLR_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN3CLR) Register Mask  */


/* -------- CFG_CFGPCLKGEN3SET : (CFG Offset: 0xA8) (R/W 32) Bit set register -------- */
#define CFG_CFGPCLKGEN3SET_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN3SET) Bit set register  Reset Value */

#define CFG_CFGPCLKGEN3SET_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN3SET) Register Mask  */


/* -------- CFG_CFGPCLKGEN3INV : (CFG Offset: 0xAC) (R/W 32) Bit invert register -------- */
#define CFG_CFGPCLKGEN3INV_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN3INV) Bit invert register  Reset Value */

