Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/cfg.h
#define CFG_CFGPCLKGEN4_TC89CD(value)         (CFG_CFGPCLKGEN4_TC89CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC89CD_Pos)) /* Assignment of value for TC89CD in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC89CD_ON_Val       _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Enable PGCLK  */
#define   CFG_CFGPCLKGEN4_TC89CD_OFF_Val      _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) Disable PGCLK  */
#define CFG_CFGPCLKGEN4_TC89CD_ON             (CFG_CFGPCLKGEN4_TC89CD_ON_Val << CFG_CFGPCLKGEN4_TC89CD_Pos) /* (CFG_CFGPCLKGEN4) Enable PGCLK Position */
#define CFG_CFGPCLKGEN4_TC89CD_OFF            (CFG_CFGPCLKGEN4_TC89CD_OFF_Val << CFG_CFGPCLKGEN4_TC89CD_Pos) /* (CFG_CFGPCLKGEN4) Disable PGCLK Position */
#define CFG_CFGPCLKGEN4_CAN0CSEL_Pos          _UINT32_(24)                                         /* (CFG_CFGPCLKGEN4) CAN0 Clock Selection Position */
#define CFG_CFGPCLKGEN4_CAN0CSEL_Msk          (_UINT32_(0x7) << CFG_CFGPCLKGEN4_CAN0CSEL_Pos)      /* (CFG_CFGPCLKGEN4) CAN0 Clock Selection Mask */
#define CFG_CFGPCLKGEN4_CAN0CSEL(value)       (CFG_CFGPCLKGEN4_CAN0CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_CAN0CSEL_Pos)) /* Assignment of value for CAN0CSEL in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_CAN0CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) No Clock  */
#define   CFG_CFGPCLKGEN4_CAN0CSEL_REFO1_Val  _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 1  */
#define   CFG_CFGPCLKGEN4_CAN0CSEL_REFO2_Val  _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 2  */
#define   CFG_CFGPCLKGEN4_CAN0CSEL_REFO3_Val  _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 3  */
#define   CFG_CFGPCLKGEN4_CAN0CSEL_REFO4_Val  _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 4  */
#define   CFG_CFGPCLKGEN4_CAN0CSEL_REFO5_Val  _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 5  */
#define   CFG_CFGPCLKGEN4_CAN0CSEL_REFO6_Val  _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 6  */
#define   CFG_CFGPCLKGEN4_CAN0CSEL_LPCLK_Val  _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN4_CAN0CSEL_NO_CLK       (CFG_CFGPCLKGEN4_CAN0CSEL_NO_CLK_Val << CFG_CFGPCLKGEN4_CAN0CSEL_Pos) /* (CFG_CFGPCLKGEN4) No Clock Position */
#define CFG_CFGPCLKGEN4_CAN0CSEL_REFO1        (CFG_CFGPCLKGEN4_CAN0CSEL_REFO1_Val << CFG_CFGPCLKGEN4_CAN0CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN4_CAN0CSEL_REFO2        (CFG_CFGPCLKGEN4_CAN0CSEL_REFO2_Val << CFG_CFGPCLKGEN4_CAN0CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN4_CAN0CSEL_REFO3        (CFG_CFGPCLKGEN4_CAN0CSEL_REFO3_Val << CFG_CFGPCLKGEN4_CAN0CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN4_CAN0CSEL_REFO4        (CFG_CFGPCLKGEN4_CAN0CSEL_REFO4_Val << CFG_CFGPCLKGEN4_CAN0CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN4_CAN0CSEL_REFO5        (CFG_CFGPCLKGEN4_CAN0CSEL_REFO5_Val << CFG_CFGPCLKGEN4_CAN0CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN4_CAN0CSEL_REFO6        (CFG_CFGPCLKGEN4_CAN0CSEL_REFO6_Val << CFG_CFGPCLKGEN4_CAN0CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN4_CAN0CSEL_LPCLK        (CFG_CFGPCLKGEN4_CAN0CSEL_LPCLK_Val << CFG_CFGPCLKGEN4_CAN0CSEL_Pos) /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN4_CAN0CD_Pos            _UINT32_(27)                                         /* (CFG_CFGPCLKGEN4) CAN0 Clock Disable Position */
#define CFG_CFGPCLKGEN4_CAN0CD_Msk            (_UINT32_(0x1) << CFG_CFGPCLKGEN4_CAN0CD_Pos)        /* (CFG_CFGPCLKGEN4) CAN0 Clock Disable Mask */
#define CFG_CFGPCLKGEN4_CAN0CD(value)         (CFG_CFGPCLKGEN4_CAN0CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_CAN0CD_Pos)) /* Assignment of value for CAN0CD in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_CAN0CD_ON_Val       _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Enable PGCLK  */
#define   CFG_CFGPCLKGEN4_CAN0CD_OFF_Val      _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) Disable PGCLK  */
#define CFG_CFGPCLKGEN4_CAN0CD_ON             (CFG_CFGPCLKGEN4_CAN0CD_ON_Val << CFG_CFGPCLKGEN4_CAN0CD_Pos) /* (CFG_CFGPCLKGEN4) Enable PGCLK Position */
#define CFG_CFGPCLKGEN4_CAN0CD_OFF            (CFG_CFGPCLKGEN4_CAN0CD_OFF_Val << CFG_CFGPCLKGEN4_CAN0CD_Pos) /* (CFG_CFGPCLKGEN4) Disable PGCLK Position */
#define CFG_CFGPCLKGEN4_CAN1CSEL_Pos          _UINT32_(28)                                         /* (CFG_CFGPCLKGEN4) CAN1 Clock Selection Position */
#define CFG_CFGPCLKGEN4_CAN1CSEL_Msk          (_UINT32_(0x7) << CFG_CFGPCLKGEN4_CAN1CSEL_Pos)      /* (CFG_CFGPCLKGEN4) CAN1 Clock Selection Mask */
#define CFG_CFGPCLKGEN4_CAN1CSEL(value)       (CFG_CFGPCLKGEN4_CAN1CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_CAN1CSEL_Pos)) /* Assignment of value for CAN1CSEL in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_CAN1CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) No Clock  */
#define   CFG_CFGPCLKGEN4_CAN1CSEL_REFO1_Val  _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 1  */
#define   CFG_CFGPCLKGEN4_CAN1CSEL_REFO2_Val  _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 2  */
#define   CFG_CFGPCLKGEN4_CAN1CSEL_REFO3_Val  _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 3  */
#define   CFG_CFGPCLKGEN4_CAN1CSEL_REFO4_Val  _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 4  */
#define   CFG_CFGPCLKGEN4_CAN1CSEL_REFO5_Val  _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 5  */
#define   CFG_CFGPCLKGEN4_CAN1CSEL_REFO6_Val  _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 6  */
#define   CFG_CFGPCLKGEN4_CAN1CSEL_LPCLK_Val  _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN4_CAN1CSEL_NO_CLK       (CFG_CFGPCLKGEN4_CAN1CSEL_NO_CLK_Val << CFG_CFGPCLKGEN4_CAN1CSEL_Pos) /* (CFG_CFGPCLKGEN4) No Clock Position */
#define CFG_CFGPCLKGEN4_CAN1CSEL_REFO1        (CFG_CFGPCLKGEN4_CAN1CSEL_REFO1_Val << CFG_CFGPCLKGEN4_CAN1CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN4_CAN1CSEL_REFO2        (CFG_CFGPCLKGEN4_CAN1CSEL_REFO2_Val << CFG_CFGPCLKGEN4_CAN1CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN4_CAN1CSEL_REFO3        (CFG_CFGPCLKGEN4_CAN1CSEL_REFO3_Val << CFG_CFGPCLKGEN4_CAN1CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN4_CAN1CSEL_REFO4        (CFG_CFGPCLKGEN4_CAN1CSEL_REFO4_Val << CFG_CFGPCLKGEN4_CAN1CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN4_CAN1CSEL_REFO5        (CFG_CFGPCLKGEN4_CAN1CSEL_REFO5_Val << CFG_CFGPCLKGEN4_CAN1CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN4_CAN1CSEL_REFO6        (CFG_CFGPCLKGEN4_CAN1CSEL_REFO6_Val << CFG_CFGPCLKGEN4_CAN1CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN4_CAN1CSEL_LPCLK        (CFG_CFGPCLKGEN4_CAN1CSEL_LPCLK_Val << CFG_CFGPCLKGEN4_CAN1CSEL_Pos) /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN4_CAN1CD_Pos            _UINT32_(31)                                         /* (CFG_CFGPCLKGEN4) CAN1 Clock Disable Position */
#define CFG_CFGPCLKGEN4_CAN1CD_Msk            (_UINT32_(0x1) << CFG_CFGPCLKGEN4_CAN1CD_Pos)        /* (CFG_CFGPCLKGEN4) CAN1 Clock Disable Mask */
#define CFG_CFGPCLKGEN4_CAN1CD(value)         (CFG_CFGPCLKGEN4_CAN1CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_CAN1CD_Pos)) /* Assignment of value for CAN1CD in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_CAN1CD_ON_Val       _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Enable PGCLK  */
#define   CFG_CFGPCLKGEN4_CAN1CD_OFF_Val      _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) Disable PGCLK  */
#define CFG_CFGPCLKGEN4_CAN1CD_ON             (CFG_CFGPCLKGEN4_CAN1CD_ON_Val << CFG_CFGPCLKGEN4_CAN1CD_Pos) /* (CFG_CFGPCLKGEN4) Enable PGCLK Position */
#define CFG_CFGPCLKGEN4_CAN1CD_OFF            (CFG_CFGPCLKGEN4_CAN1CD_OFF_Val << CFG_CFGPCLKGEN4_CAN1CD_Pos) /* (CFG_CFGPCLKGEN4) Disable PGCLK Position */
#define CFG_CFGPCLKGEN4_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (CFG_CFGPCLKGEN4) Register Mask  */


