Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/cfg.h
/* -------- CFG_CFGPCLKGEN4CLR : (CFG Offset: 0xB4) (R/W 32) Bit clear register -------- */
#define CFG_CFGPCLKGEN4CLR_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN4CLR) Bit clear register  Reset Value */

#define CFG_CFGPCLKGEN4CLR_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN4CLR) Register Mask  */


/* -------- CFG_CFGPCLKGEN4SET : (CFG Offset: 0xB8) (R/W 32) Bit set register -------- */
#define CFG_CFGPCLKGEN4SET_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN4SET) Bit set register  Reset Value */

#define CFG_CFGPCLKGEN4SET_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN4SET) Register Mask  */


/* -------- CFG_CFGPCLKGEN4INV : (CFG Offset: 0xBC) (R/W 32) Bit invert register -------- */
#define CFG_CFGPCLKGEN4INV_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN4INV) Bit invert register  Reset Value */

#define CFG_CFGPCLKGEN4INV_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN4INV) Register Mask  */


/* -------- CFG_USER_ID : (CFG Offset: 0xC0) (R/W 32)  -------- */
#define CFG_USER_ID_RESETVALUE                _UINT32_(0x00)                                       /*  (CFG_USER_ID)   Reset Value */

#define CFG_USER_ID_USER_ID_Pos               _UINT32_(0)                                          /* (CFG_USER_ID) User unique ID, readable using the SWD USER_ID instruction Position */
#define CFG_USER_ID_USER_ID_Msk               (_UINT32_(0xFFFF) << CFG_USER_ID_USER_ID_Pos)        /* (CFG_USER_ID) User unique ID, readable using the SWD USER_ID instruction Mask */
#define CFG_USER_ID_USER_ID(value)            (CFG_USER_ID_USER_ID_Msk & (_UINT32_(value) << CFG_USER_ID_USER_ID_Pos)) /* Assignment of value for USER_ID in the CFG_USER_ID register */
#define CFG_USER_ID_Msk                       _UINT32_(0x0000FFFF)                                 /* (CFG_USER_ID) Register Mask  */


/* -------- CFG_USER_IDCLR : (CFG Offset: 0xC4) (R/W 32) Bit clear register -------- */
#define CFG_USER_IDCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (CFG_USER_IDCLR) Bit clear register  Reset Value */

#define CFG_USER_IDCLR_Msk                    _UINT32_(0x00000000)                                 /* (CFG_USER_IDCLR) Register Mask  */


/* -------- CFG_USER_IDSET : (CFG Offset: 0xC8) (R/W 32) Bit set register -------- */
#define CFG_USER_IDSET_RESETVALUE             _UINT32_(0x00)                                       /*  (CFG_USER_IDSET) Bit set register  Reset Value */

#define CFG_USER_IDSET_Msk                    _UINT32_(0x00000000)                                 /* (CFG_USER_IDSET) Register Mask  */


/* -------- CFG_USER_IDINV : (CFG Offset: 0xCC) (R/W 32) Bit invert register -------- */
#define CFG_USER_IDINV_RESETVALUE             _UINT32_(0x00)                                       /*  (CFG_USER_IDINV) Bit invert register  Reset Value */

#define CFG_USER_IDINV_Msk                    _UINT32_(0x00000000)                                 /* (CFG_USER_IDINV) Register Mask  */


/* -------- CFG_SYSKEY : (CFG Offset: 0xD0) (R/W 32)  -------- */
#define CFG_SYSKEY_RESETVALUE                 _UINT32_(0x00)                                       /*  (CFG_SYSKEY)   Reset Value */

#define CFG_SYSKEY_SYSKEY_Pos                 _UINT32_(0)                                          /* (CFG_SYSKEY) System Key Position */
#define CFG_SYSKEY_SYSKEY_Msk                 (_UINT32_(0xFFFFFFFF) << CFG_SYSKEY_SYSKEY_Pos)      /* (CFG_SYSKEY) System Key Mask */
#define CFG_SYSKEY_SYSKEY(value)              (CFG_SYSKEY_SYSKEY_Msk & (_UINT32_(value) << CFG_SYSKEY_SYSKEY_Pos)) /* Assignment of value for SYSKEY in the CFG_SYSKEY register */
#define CFG_SYSKEY_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (CFG_SYSKEY) Register Mask  */


/* -------- CFG_PMD1 : (CFG Offset: 0xE0) (R/W 32)  -------- */
#define CFG_PMD1_RESETVALUE                   _UINT32_(0x00)                                       /*  (CFG_PMD1)   Reset Value */

#define CFG_PMD1_DACMD_Pos                    _UINT32_(5)                                          /* (CFG_PMD1) DAC Module Disable Position */
#define CFG_PMD1_DACMD_Msk                    (_UINT32_(0x1) << CFG_PMD1_DACMD_Pos)                /* (CFG_PMD1) DAC Module Disable Mask */
#define CFG_PMD1_DACMD(value)                 (CFG_PMD1_DACMD_Msk & (_UINT32_(value) << CFG_PMD1_DACMD_Pos)) /* Assignment of value for DACMD in the CFG_PMD1 register */
#define CFG_PMD1_ACMD_Pos                     _UINT32_(6)                                          /* (CFG_PMD1) AC Module Disable Position */
#define CFG_PMD1_ACMD_Msk                     (_UINT32_(0x1) << CFG_PMD1_ACMD_Pos)                 /* (CFG_PMD1) AC Module Disable Mask */
#define CFG_PMD1_ACMD(value)                  (CFG_PMD1_ACMD_Msk & (_UINT32_(value) << CFG_PMD1_ACMD_Pos)) /* Assignment of value for ACMD in the CFG_PMD1 register */
#define CFG_PMD1_ADCMD_Pos                    _UINT32_(7)                                          /* (CFG_PMD1) ADC Controller Module Disable Position */
#define CFG_PMD1_ADCMD_Msk                    (_UINT32_(0x1) << CFG_PMD1_ADCMD_Pos)                /* (CFG_PMD1) ADC Controller Module Disable Mask */
#define CFG_PMD1_ADCMD(value)                 (CFG_PMD1_ADCMD_Msk & (_UINT32_(value) << CFG_PMD1_ADCMD_Pos)) /* Assignment of value for ADCMD in the CFG_PMD1 register */
#define CFG_PMD1_ADCSARMD_Pos                 _UINT32_(8)                                          /* (CFG_PMD1) ADC SAR Core Module Disable Position */
#define CFG_PMD1_ADCSARMD_Msk                 (_UINT32_(0x1) << CFG_PMD1_ADCSARMD_Pos)             /* (CFG_PMD1) ADC SAR Core Module Disable Mask */
#define CFG_PMD1_ADCSARMD(value)              (CFG_PMD1_ADCSARMD_Msk & (_UINT32_(value) << CFG_PMD1_ADCSARMD_Pos)) /* Assignment of value for ADCSARMD in the CFG_PMD1 register */
#define CFG_PMD1_CVDMD_Pos                    _UINT32_(9)                                          /* (CFG_PMD1) ADC CVD Module Disable Position */
#define CFG_PMD1_CVDMD_Msk                    (_UINT32_(0x1) << CFG_PMD1_CVDMD_Pos)                /* (CFG_PMD1) ADC CVD Module Disable Mask */
#define CFG_PMD1_CVDMD(value)                 (CFG_PMD1_CVDMD_Msk & (_UINT32_(value) << CFG_PMD1_CVDMD_Pos)) /* Assignment of value for CVDMD in the CFG_PMD1 register */
#define CFG_PMD1_ADCSARSHRMD_Pos              _UINT32_(10)                                         /* (CFG_PMD1) Shared ADC SAR Core Module Disable Position */
#define CFG_PMD1_ADCSARSHRMD_Msk              (_UINT32_(0x1) << CFG_PMD1_ADCSARSHRMD_Pos)          /* (CFG_PMD1) Shared ADC SAR Core Module Disable Mask */
#define CFG_PMD1_ADCSARSHRMD(value)           (CFG_PMD1_ADCSARSHRMD_Msk & (_UINT32_(value) << CFG_PMD1_ADCSARSHRMD_Pos)) /* Assignment of value for ADCSARSHRMD in the CFG_PMD1 register */
#define CFG_PMD1_SQIMD_Pos                    _UINT32_(29)                                         /* (CFG_PMD1) SQI Module Disable Position */
#define CFG_PMD1_SQIMD_Msk                    (_UINT32_(0x1) << CFG_PMD1_SQIMD_Pos)                /* (CFG_PMD1) SQI Module Disable Mask */
#define CFG_PMD1_SQIMD(value)                 (CFG_PMD1_SQIMD_Msk & (_UINT32_(value) << CFG_PMD1_SQIMD_Pos)) /* Assignment of value for SQIMD in the CFG_PMD1 register */
#define CFG_PMD1_Msk                          _UINT32_(0x200007E0)                                 /* (CFG_PMD1) Register Mask  */


/* -------- CFG_PMD1CLR : (CFG Offset: 0xE4) (R/W 32) Bit clear register -------- */
#define CFG_PMD1CLR_RESETVALUE                _UINT32_(0x00)                                       /*  (CFG_PMD1CLR) Bit clear register  Reset Value */

#define CFG_PMD1CLR_Msk                       _UINT32_(0x00000000)                                 /* (CFG_PMD1CLR) Register Mask  */


/* -------- CFG_PMD1SET : (CFG Offset: 0xE8) (R/W 32) Bit set register -------- */
#define CFG_PMD1SET_RESETVALUE                _UINT32_(0x00)                                       /*  (CFG_PMD1SET) Bit set register  Reset Value */

#define CFG_PMD1SET_Msk                       _UINT32_(0x00000000)                                 /* (CFG_PMD1SET) Register Mask  */


/* -------- CFG_PMD1INV : (CFG Offset: 0xEC) (R/W 32) Bit invert register -------- */
#define CFG_PMD1INV_RESETVALUE                _UINT32_(0x00)                                       /*  (CFG_PMD1INV) Bit invert register  Reset Value */

